Revit 2027 API
GenericZone.GetSketchId Method
 Gets the sketch id for the generic zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetSketchId()
Public Function GetSketchId As ElementId
public:
ElementId^ GetSketchId()
member GetSketchId : unit -> ElementId
Return Value
ElementId
 The sketch element id for the sketch-based generic zone.
Exceptions
Exception | Condition
InvalidOperationException |  This generic zone must be sketch-based.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace